Revit 2027 API
BuiltInFailures.ConstraintFailures.UndeletedConstraintsLabel Property
 A dimension labeled by a parameter is being deleted, but the elements will still be constrained. Push "Unconstrain" to remove the constraints or "OK" to leave elements constrained..
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId UndeletedConstraintsLabel { get; }
Public Shared ReadOnly Property UndeletedConstraintsLabel As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ UndeletedConstraintsLabel {
	FailureDefinitionId^ get ();
}
static member UndeletedConstraintsLabel : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.ConstraintFailures Class
Autodesk.Revit.DB Namespace